In [1]:
import pandas as pd

In [2]:
fp = 'https://bit.ly/bitcoin-purchases'

In [3]:
fp

'https://bit.ly/bitcoin-purchases'

In [4]:
df=pd.read_csv(fp)

In [6]:
df.head()

                      bitcoin address wire amount          credit card
0  1HeUNvQfhjn8afvjMrMEX5VQB5zy8AacXZ    $2268.82  6759241310493014168
1  18xA8uEzQsEQpyfJWrrLmnu72ut7p2GgeU    $4590.27     6394078189900621
2  1CPLebXd6VKdEmD6xsVByYDbsyhkZ4XzrE    $6160.48     3539006321388994
3  1ESn9zPPwAExS98jqhjkDPd7tGeoevL42u    $6647.19     3560801557252993
4  1JLYsDExCUsEPrN6vNsEgJubJE4xqWtqhp    $3759.40     5349906235596126

In [7]:
df.isna().sum()

bitcoin address    0
wire amount        0
credit card        0
dtype: int64

In [12]:
df['wire amount']=df['wire amount'].str.replace('$','')

In [13]:
df['wire amount'].str.replace('$','').astype('float')
df['wire amount']=df['wire amount'].str.replace('$','').astype('float') # convertir en float64 les types besoin pour soustraire avec 1000

In [15]:
df['wire amount']-1000

0      1268.82
1      3590.27
2      5160.48
3      5647.19
4      2759.40
        ...
995    7777.99
996    6614.59
997     710.21
998    4240.64
999    4672.95
Name: wire amount, Length: 1000, dtype: float64

In [17]:
fp2='https://bit.ly/bitcoin-purchases2'
print(fp2)

https://bit.ly/bitcoin-purchases2

In [18]:
df2=pd.read_csv(fp2)

In [21]:
df2.head()

                      bitcoin address wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311,06  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032,44  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592

In [22]:
df2.tail()

                        bitcoin address wire amount          credit card
995  1Jmz4FMQENDkrtkivVdXM8SiC6ZCJVTDhp     ¥844.68     5541649583285688
996  1GCZKgPV9277czn1RsTYoubCwhbndUvPZU    €1433,63  6304232254235660027
997   1LK2DsWBUmSAsqg7n46sdgg4v2SNrqEPM    €3814,11     3546750658508135
998  1PD6oNfFEnxMsR1PvUvkjHQdHYLCewLJhq    $2900.85  6333272716093574938
999  1B2vk6p7usuV4dfrBMLo8Rzpb5NatTmE8R    $1587.16     4913614335644981

In [23]:
df2.isna().sum()

bitcoin address    0
wire amount        0
credit card        0
dtype: int64

In [24]:
df2.shape

(1000, 3)

In [54]:
df2=pd.read_csv(fp2)

In [55]:
df2['wire amount']=df2['wire amount'].str.replace(',','.')
df2

                        bitcoin address wire amount          credit card
0    1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92     3543456448666398
1    1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311.06     3584615208479876
2    1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032.44     6370577480710876
3    15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74     4508652385157398
4    18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44      374622922103592
..                                  ...         ...                  ...
995  1Jmz4FMQENDkrtkivVdXM8SiC6ZCJVTDhp     ¥844.68     5541649583285688
996  1GCZKgPV9277czn1RsTYoubCwhbndUvPZU    €1433.63  6304232254235660027
997   1LK2DsWBUmSAsqg7n46sdgg4v2SNrqEPM    €3814.11     3546750658508135
998  1PD6oNfFEnxMsR1PvUvkjHQdHYLCewLJhq    $2900.85  6333272716093574938
999  1B2vk6p7usuV4dfrBMLo8Rzpb5NatTmE8R    $1587.16     4913614335644981

[1000 rows x 3 columns]

### How to replace the amount of all money to one Unit of money

In [56]:
df2['wire amount'].str.get(0) # or we can get it with df2['wire amount'].str[0]

0      £
1      €
2      €
3      ¥
4      £
      ..
995    ¥
996    €
997    €
998    $
999    $
Name: wire amount, Length: 1000, dtype: object

In [57]:
df2['devise']=df2['wire amount'].str.get(0) # or we can get it with df2['wire amount'].str[0]
df2

,bitcoin address,wire amount,credit card,devise
0,1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe,£8356.92,3543456448666398,£
1,1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q,€311.06,3584615208479876,€
2,1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP,€2032.44,6370577480710876,€
3,15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6,¥8155.74,4508652385157398,¥
4,18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ,£3265.44,374622922103592,£
...,...,...,...,...
995,1Jmz4FMQENDkrtkivVdXM8SiC6ZCJVTDhp,¥844.68,5541649583285688,¥
996,1GCZKgPV9277czn1RsTYoubCwhbndUvPZU,€1433.63,6304232254235660027,€
997,1LK2DsWBUmSAsqg7n46sdgg4v2SNrqEPM,€3814.11,3546750658508135,€
998,1PD6oNfFEnxMsR1PvUvkjHQdHYLCewLJhq,$2900.85,6333272716093574938,$
999,1B2vk6p7usuV4dfrBMLo8Rzpb5NatTmE8R,$1587.16,4913614335644981,$

In [58]:
df2['wire amount']=df2['wire amount'].str.slice(1, None) # or .str[1:]
df2

,bitcoin address,wire amount,credit card,devise
0,1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe,8356.92,3543456448666398,£
1,1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q,311.06,3584615208479876,€
2,1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP,2032.44,6370577480710876,€
3,15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6,8155.74,4508652385157398,¥
4,18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ,3265.44,374622922103592,£
...,...,...,...,...
995,1Jmz4FMQENDkrtkivVdXM8SiC6ZCJVTDhp,844.68,5541649583285688,¥
996,1GCZKgPV9277czn1RsTYoubCwhbndUvPZU,1433.63,6304232254235660027,€
997,1LK2DsWBUmSAsqg7n46sdgg4v2SNrqEPM,3814.11,3546750658508135,€
998,1PD6oNfFEnxMsR1PvUvkjHQdHYLCewLJhq,2900.85,6333272716093574938,$
999,1B2vk6p7usuV4dfrBMLo8Rzpb5NatTmE8R,1587.16,4913614335644981,$

In [59]:
df2.dtypes

bitcoin address    object
wire amount        object
credit card         int64
devise             object
dtype: object

In [60]:
df2['wire amount']=df2['wire amount'].astype('float')
df2

,bitcoin address,wire amount,credit card,devise
0,1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe,8356.92,3543456448666398,£
1,1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q,311.06,3584615208479876,€
2,1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP,2032.44,6370577480710876,€
3,15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6,8155.74,4508652385157398,¥
4,18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ,3265.44,374622922103592,£
...,...,...,...,...
995,1Jmz4FMQENDkrtkivVdXM8SiC6ZCJVTDhp,844.68,5541649583285688,¥
996,1GCZKgPV9277czn1RsTYoubCwhbndUvPZU,1433.63,6304232254235660027,€
997,1LK2DsWBUmSAsqg7n46sdgg4v2SNrqEPM,3814.11,3546750658508135,€
998,1PD6oNfFEnxMsR1PvUvkjHQdHYLCewLJhq,2900.85,6333272716093574938,$
999,1B2vk6p7usuV4dfrBMLo8Rzpb5NatTmE8R,1587.16,4913614335644981,$

In [ ]:
import random

def makeNumberStr(sep=[',']):
    avantVirgule = str(random.randint(1,1000))
    aprèsVirgule = '{:02}'.format(random.randint(0,99))
    sep = random.choice(sep)
    return avantVirgule + sep + aprèsVirgule 
    
col1 = [makeNumberStr() for _ in range(200)]
col2 = [makeNumberStr(['.',',']) for _ in range(200)]
    
exo1 = pd.DataFrame(data={"col1":col1,"col2":col2})

In [95]:
import random

def makeNumberStr(sep=[','], signs=['€','$']):
    avantVirgule = str(random.randint(1,1000))
    aprèsVirgule = '{:02}'.format(random.randint(0,99))
    sep = random.choice(sep)
    sign = random.choice(signs)
    return avantVirgule + sep + aprèsVirgule + sign
    
col1 = [makeNumberStr() for _ in range(200)]
col2 = [makeNumberStr(['.',',']) for _ in range(200)]
    
exo2 = pd.DataFrame(data={"col1":col1,"col2":col2})

In [96]:
exo2.dtypes

col1    object
col2    object
dtype: object

In [97]:
exo2

        col1     col2
0    276,59$  322.53€
1    570,43$  809.13€
2    239,40€  276,52€
3    674,84€  269,77€
4    362,93€   52.04€
..       ...      ...
195  230,19$  534,83$
196  617,12€  852,81$
197  278,42$   90.38€
198   94,72€  646.51€
199  210,10$  720.83€

[200 rows x 2 columns]

In [98]:
exo2['col1']=exo2['col1'].str.replace(',','.')
exo2['col2']=exo2['col2'].str.replace(',','.')

exo2['col1_symb']=exo2['col1'].str.get(-1)
exo2['col1']=exo2['col1'].str.slice(None,-1).astype('float')

exo2['col2_symb']=exo2['col2'].str.get(-1)
exo2['col2']=exo2['col2'].str.slice(None,-1).astype('float')

exo2

       col1    col2 col1_symb col2_symb
0    276.59  322.53         $         €
1    570.43  809.13         $         €
2    239.40  276.52         €         €
3    674.84  269.77         €         €
4    362.93   52.04         €         €
..      ...     ...       ...       ...
195  230.19  534.83         $         $
196  617.12  852.81         €         $
197  278.42   90.38         $         €
198   94.72  646.51         €         €
199  210.10  720.83         $         €

[200 rows x 4 columns]

slice notes : 

           1, 2, 3, 4, 5, 6,

    (None) "a, b, c, d, e, f" (None)

-len(s)    -6,-5,-4,-3,-2,-1  -> négatif

Slicing:
        S[:] -> None to None
        S[None:-1] -> from start of abcdef to before (f)